# Taps
tap "homebrew/bundle"
tap "buo/cask-upgrade"

cask_args appdir: "~/Applications"

brew "cask" # to install casks
brew "mas" # to install apps via mac app store

brew "stow" 
brew "coreutils"
brew "git" # scm
brew "grep" # find matching patterns in a file - global regular expression print
brew "ripgrep" # better grep
brew "httpie" # curl replacement
brew "curl" # get a file from an http server
brew "tree" # display dirs as trees
brew "fzf" # fuzzy finder
brew "wget" # internet file retriever
brew "htop" # better top
brew "tldr" # tldr of man pages
brew "trash" # moves a file to trash as opposed to rm which permanently deletes
brew "git-delta" # better git diff using bat
brew "bat" # better cat with syntax highlighting
brew "eza" # better ls
brew "shellcheck"
brew "duf" # disk usage
brew "speedtest-cli"

# Development
brew "python3" # Python dev
# brew "uv"
# brew "openjdk" # Java dev
# brew "jenv"
brew "ruby" # Ruby necessary for homebrew
brew "node" # JS runtime
brew "nvm" # Node version manager
brew "pnpm" # JS package manager

# Shell & Prompt
brew "bash" # macos bash is old
brew "zsh" # my preferred shell
brew "starship" # fast prompt
brew "antigen" # plugin manager for oh-my-zsh
brew "zsh-syntax-highlighting" # better zsh syntax highlighting
brew "zsh-autosuggestions" # better zsh autosuggestions

# Apps
cask "1password" # Password Manager
cask "1password-cli"
cask "obsidian" # Notes
cask "spotify" # Music
cask "discord"
cask "zoom"
cask "google-chrome"
# cask "firefox"
cask "visual-studio-code"
# cask "postman"
cask "ghostty" # Terminal
# cask "jetbrains-toolbox" # Jetbrains installer
# cask "docker" # Containerize for deployment
cask "iina" # Mac-like Video Player
cask "istat-menus" # stats in menu bar
cask "itsycal" # Nice calendar in menu bar
cask "cheatsheet" # CMD to pull up shortcuts
cask "MonitorControl" # Manage brightness on external display
cask "hiddenbar" # Hide some menu bar items

# Quick look plugins
cask "qlmarkdown"
cask "quicklook-json"

# Fonts
# cask "font-jetbrains-mono"
# cask "font-source-code-pro"

# Mac app store
mas "Hand Mirror", id: 1502839586

# Safari extensions
mas "1password-for-safari", id: 1569813296
mas "Save to Raindrop.io", id: 1549370672

# vscode extensions
vscode "timonwong.shellcheck"
vscode "ban.spellright"
vscode "davidbwaters.macos-modern-theme"